Data Pegawai CRUD CI4/app/Controllers/Pegawai.php

SELECT *
FROM `Pegawai`
ORDER BY `id` DESC
 LIMIT 2, 2
SELECT COUNT(*) AS `numrows`
FROM `Pegawai`
---
    public function index(): string
    {
        $jumlahBaris = 2;
        $katakunci = $this->request->getGet('katakunci');
        if($katakunci){
            $pencarian = $this->model->cari($katakunci);
        } else {
            $pencarian = $this -> model;
        }

        $data['katakunci'] = $katakunci;
        $data['dataPegawai'] = $this->model->orderBy('id','desc')->paginate($jumlahBaris);